КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_НастройкиПолномочийМЧД/КонтурЛогистика_НастройкиПолномочийМЧД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_НастройкиПолномочийМЧД</name>
  <resources>
    <name>НаименованиеПолномочия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Полномочие</name>
    <type>
      <types>EnumRef.КонтурЛогистика_Полномочия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КодКлассификатора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипТитула</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыЛогистическихДокументов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДопПараметр</name>
    <comment>При проверке полномочий задается через подключаемы модуль</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_НастройкиПолномочийМЧД/Forms/ФормаВыбораНастройкиПолномочий/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("МЧД", МЧД);
	Параметры.Свойство("Полномочие", Полномочие);
	Параметры.Свойство("ОтпечатокСертификата", ОтпечатокСертификата);
	Параметры.Свойство("КомуВыданСертификат", КомуВыданСертификат);
	Параметры.Свойство("ТипТитула", ТипТитула);
	Параметры.Свойство("ЗапуститьРегЗадание", ЗапуститьРегЗадание);
	
	Если МЧД.Полномочия.Количество() = 0 Тогда
		
		Действие = "Доверять";
		
		Элементы.Действие.СписокВыбора.Удалить(Элементы.Действие.СписокВыбора.НайтиПоЗначению("ДобавитьПолномочия"));
				
		Элементы.Предупреждение.Заголовок = "У МЧД полномочия заданы в свободной форме. Разрешение полномочий не доступно";
		
		Элементы.ГруппаПредупреждение.Видимость = Истина;
		Элементы.ПодсказкаРазрешитьПолномочия.Видимость = Ложь;
			
	Иначе
		
		Действие = "ДобавитьПолномочия";
		
		Элементы.ГруппаПредупреждение.Видимость = Ложь;
		
	КонецЕсли;
	
	ЗаполнитьДаннымиИзМЧД();
					
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДаннымиИзМЧД()
	
	ТекстовоеПолномочие = МЧД.ТекстовоеПолномочие;
	Элементы.ТекстовоеПолномочие.Видимость = ЗначениеЗаполнено(МЧД.ТекстовоеПолномочие);
		
	Если Параметры.Свойство("МЧД") Тогда
		
		Для каждого ПолномочиеМЧД Из Параметры.МЧД.Полномочия Цикл
			
			НоваяСтрока = ПолномочияИзМЧД.Добавить();
			НоваяСтрока.Код = ПолномочиеМЧД.Код;
			НоваяСтрока.Наименование = ПолномочиеМЧД.Наименование;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОтключитьПроверкуПолномочий(ДействиеВыполнено)
	
	МЧДОб = МЧД.ПолучитьОбъект();
	МЧДОб.ПроверятьПолномочия = Ложь;
	МЧДОб.Записать();
	
	ДействиеВыполнено = Истина;

КонецПроцедуры
	
&НаКлиенте
Процедура ОбработчикОкончанияНастроекПолномочий(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт
	
	ВыполнитьОбработкуОповещения(Новый ОписаниеОповещения("ОбработчикПерепроверить", ЭтаФорма.ВладелецФормы));
	
КонецПроцедуры

&НаКлиенте
Процедура ДействиеПриИзменении(Элемент)
	
	УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеЭлементамиФормы()
	
	Элементы.ГруппаПолномочияИзМЧД.Видимость = Действие = "ДобавитьПолномочия";
	                                                  
	Если Действие = "ДобавитьПолномочия" Тогда
		Элементы.ПодсказкаРазрешитьПолномочия.ЦветТекста = Новый Цвет(51, 51, 51);		
		Элементы.ПодсказкаОтключитьПроверку.ЦветТекста = Новый Цвет(162, 162, 162);
		Элементы.ПодсказкаДоверять.ЦветТекста = Новый Цвет(162, 162, 162);
	ИначеЕсли Действие = "Доверять" Тогда
		Элементы.ПодсказкаДоверять.ЦветТекста = Новый Цвет(51, 51, 51);
		Элементы.ПодсказкаРазрешитьПолномочия.ЦветТекста = Новый Цвет(162, 162, 162);
		Элементы.ПодсказкаОтключитьПроверку.ЦветТекста = Новый Цвет(162, 162, 162);
	ИначеЕсли Действие = "ОтключитьПроверку" Тогда
		Элементы.ПодсказкаОтключитьПроверку.ЦветТекста = Новый Цвет(51, 51, 51);
		Элементы.ПодсказкаРазрешитьПолномочия.ЦветТекста = Новый Цвет(162, 162, 162);
		Элементы.ПодсказкаДоверять.ЦветТекста = Новый Цвет(162, 162, 162);
	КонецЕсли;
	
	Элементы.ФормаВыполнить.Заголовок = Элементы.Действие.СписокВыбора.НайтиПоЗначению(Действие);
	
	Элементы.ФормаВыполнить.Видимость = ЗначениеЗаполнено(Действие);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьДействие(Команда)
	
	Если Не ЗначениеЗаполнено(Действие) Тогда
		Сообщить("Не выбран вариант настройки полномочий");
		Возврат;
	КонецЕсли;
	
	ДействиеВыполнено = Ложь;
	
	Если Действие = "ОтключитьПроверку" Тогда
		
		ОтключитьПроверкуПолномочий(ДействиеВыполнено);	
		
	ИначеЕсли Действие = "Доверять" Тогда
		
		ДоверятьПолномочиямМЧД(ДействиеВыполнено);
		
	ИначеЕсли Действие = "ДобавитьПолномочия" Тогда
		
		ДобавитьПолномочияМЧД(ДействиеВыполнено);
		
	КонецЕсли;
	
	Если ДействиеВыполнено Тогда
	
		ВыполнитьОбработкуОповещения(Новый ОписаниеОповещения("ОбработчикПерепроверить", ЭтаФорма.ВладелецФормы));
		
		Если ЗапуститьРегЗадание Тогда
			
			ПараметрыФоновогоЗадания = Новый Структура;
			ПараметрыФоновогоЗадания.Вставить("ОтпечатокСертификата", ОтпечатокСертификата);
			ПараметрыФоновогоЗадания.Вставить("КомуВыданСертификат", КомуВыданСертификат);
			ПараметрыФоновогоЗадания.Вставить("МЧД", МЧД);
			ПараметрыФоновогоЗадания.Вставить("ОшибкиМЧД", КонтурЛогистика_МашиночитаемыеДоверенностиКлиентСервер.КодОшибкиСтатусаПолномочияМЧД());
					
			КонтурЛогистика_ДлительныеОперацииКлиент.ЗапуститьФоновоеВыполнениеСотслеживаниемВНовойФорме("КонтурЛогистика_ДлительныеОперацииСервер.УдалитьОшибкиМЧД",
				"Удаление ошибок МЧД",
				ПараметрыФоновогоЗадания,
				"Удаление ошибок МЧД",
				Ложь,
				Истина,
				РежимОткрытияОкнаФормы.Независимый);
							
		КонецЕсли;
		
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДоверятьПолномочиямМЧД(ДействиеВыполнено)
	
	КонтурЛогистика_МашиночитаемыеДовернностиСервер.ДобавитьДоверенныеСертификаты(МЧД, ОтпечатокСертификата, КомуВыданСертификат, , Истина, Полномочие);
	
	ДействиеВыполнено = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьПолномочияМЧД(ДействиеВыполнено)
	
	НетОтметки = Истина;
	Для каждого ПолномочиеМЧД Из ПолномочияИзМЧД Цикл
			
		Если ПолномочиеМЧД.Отметка Тогда
			НетОтметки = Ложь;
			Прервать;
		КонецЕсли;
			
	КонецЦикла;
	
	Если НетОтметки Тогда
		Сообщить("Не выбрано ни одно полномочие");
		Возврат;
	КонецЕсли;
	
	Для каждого ПолномочиеМЧД Из ПолномочияИзМЧД Цикл
			
		Если Не ПолномочиеМЧД.Отметка Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяЗапись = РегистрыСведений.КонтурЛогистика_НастройкиПолномочийМЧД.СоздатьМенеджерЗаписи();
		НоваяЗапись.Полномочие = Полномочие;
		НоваяЗапись.ТипТитула = ?(ДляВсехТитулов, Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПустаяСсылка(), ТипТитула);
		НоваяЗапись.КодКлассификатора = ПолномочиеМЧД.Код;
		НоваяЗапись.НаименованиеПолномочия = ПолномочиеМЧД.Наименование;
		НоваяЗапись.Записать();
				
	КонецЦикла;
	
	ДействиеВыполнено = Истина;
	
КонецПроцедуры
